2021.10.12.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-12 Tue 14:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2021.10.05.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2021.10.19.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of October 05 to 12, 2021.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Release of ocaml-sf/learn-ocaml:0.13.0</a></li>
<li><a href="#2">Release of odoc 2.0.0</a></li>
<li><a href="#3">The road to OCaml 5.0</a></li>
<li><a href="#4">Become an Outreachy Mentor: support the growth and diversity of the OCaml community</a></li>
<li><a href="#5">Windows-friendly OCaml 4.12 distribution 2nd preview release (0.2.0)</a></li>
<li><a href="#6">first release of osh: https://osh.ocamlpro.com</a></li>
<li><a href="#7">first release of pyast</a></li>
<li><a href="#8">Multiple open positions (postdoc, PhD, intern) on runtime verification at CEA LIST, France</a></li>
<li><a href="#9">Postdoc position in Effect Handler Oriented Programming</a></li>
<li><a href="#10">OCaml compiler development newsletter, issue 3: June-September 2021</a></li>
<li><a href="#11">Odig 0.0.7, lookup documentation of installed OCaml packages</a></li>
<li><a href="#12">OCaml Café: Wed, Oct 13 @ 1pm (U.S. Central)</a></li>
<li><a href="#13">Multicore OCaml: September 2021, effect handlers will be in OCaml 5.0!</a></li>
<li><a href="#14">Alcotest 1.5.0</a></li>
<li><a href="#15">Other OCaml News</a></li>
<li><a href="#orgfd59396">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">Release of ocaml-sf/learn-ocaml:0.13.0</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-release-of-ocaml-sf-learn-ocaml-0-13-0/8577/1">https://discuss.ocaml.org/t/ann-release-of-ocaml-sf-learn-ocaml-0-13-0/8577/1</a>
</p>
</div>
