2021.10.12.html

<div id="outline-container-org1398df7" class="outline-3">
<h3 id="org1398df7">Erik Martin-Dorel announced</h3>
<div class="outline-text-3" id="text-org1398df7">
<p>
We are very pleased to announce the immediate availability of the latest stable release of
<a href="https://github.com/ocaml-sf/learn-ocaml">Learn-OCaml</a>, version <code>0.13.0</code>.
</p>

<p>
Many thanks to all users and developers that reported bugs, contributed features or patches ✨ and in particular,
special thanks go to @yurug and @AltGr for their precious advice and help during the preparation of this release.
</p>

<p>
A (mostly) comprehensive list of the features, fixes, and enhancements offered by this release is available in <a href="https://github.com/ocaml-sf/learn-ocaml/releases/tag/v0.13.0">the
Release Notes</a>.
</p>

<p>
Beyond this list of changes, note that:
</p>

<ul class="org-ul">
<li>We now switch to <b>semantic versioning</b>, so that this version is git-tagged <code>v0.13.0</code> and not just <code>0.13</code>.</li>
<li>The REST API did <b>not</b> change (between the previous stable version 0.12 and version 0.13.0).</li>
<li>The <b>"exodir" format</b> has been slightly extended (but the <a href="https://ocaml-sf.org/learn-ocaml/tutorials/step-0.html">documentation online</a> of these changes is not yet up-to-date), keeping a strong focus on backward-compatibility (see e.g. <a href="https://github.com/ocaml-sf/learn-ocaml/pull/397">PR #397</a> for related remarks).</li>
<li>All the main <b>binaries of Learn-OCaml</b> (<code>learn-ocaml-client</code>, <code>learn-ocaml</code>, and the native <code>learn-ocaml-server</code>) are now statically built and available in the <a href="https://github.com/ocaml-sf/learn-ocaml/releases/"><b>Release page</b></a>, for Linux and macOS.</li>
<li>The whole codebase of Learn-OCaml has been ported to <b>OCaml 4.12</b> (including the toplevel environment that is exposed to students).</li>
<li>We now <b>relax the coupling between client/server</b>, and commit to <b>keeping backward-compatibility</b> for the latest <code>learn-ocaml-client</code> w.r.t. the previous versions (so, <code>learn-ocaml-client.0.13.0</code> can interact with servers <code>learn-ocaml.{0.12, 0.13.0}</code> smoothly − see <a href="https://www.github.com/ocaml-sf/learn-ocaml/issues/426">PR #426</a> for context).</li>
<li>The <code>learn-ocaml-client</code> CLI API did not change, except that a command <b><code>learn-ocaml-client server-version</code></b> has been added, to distinguish between the server version and the (possibly more recent) <code>learn-ocaml-client --version</code> (see <a href="https://github.com/ocaml-sf/learn-ocaml/pull/429">PR #429</a> for details).</li>
<li><p>
Docker images are still available on <a href="https://hub.docker.com/r/ocamlsf/learn-ocaml"><b>Docker Hub</b></a>, e.g., to easily spin a local server from a repository exercises, you can do:
</p>
<pre class="example" id="orgf164ef3">
sudo docker run --name=server-test -v "$PWD/demo-repository:/repository:ro" \
  -p 8080:8080 ocamlsf/learn-ocaml:0.13.0
</pre>
<p>
More details on the Docker setup can be found in <a href="https://ocaml-sf.org/learn-ocaml/howto-deploy-a-learn-ocaml-instance.html">How to deploy a learn-ocaml instance</a>.
</p></li>
<li>(If you migrate from <code>0.12</code> to <code>0.13.0</code> in your deployments, beware that the mere bump of OCaml's version may cause some of your graders to fail.)</li>
<li>A <a href="https://github.com/ocaml/opam-repository/pull/19698">dedicated PR</a> has also been opened in <b>opam-repository</b>.</li>
<li>As noted above, several architectural changes have been done about the <code>learn-ocaml-client</code> as this tool plays a</li>
</ul>
<p>
key "pivot" role, for students that would like to use
<b>Tuareg+Merlin+<a href="https://github.com/pfitaxel/learn-ocaml.el">learn-ocaml-mode</a></b> and interact with a Learn-OCaml
server backend directly from Emacs (and thus benefit from the advantages of both Merlin and Learn-OCaml's exercise
grading feature).
</p>

<p>
We hope to be able to release 0.14.0 soon, specifically to integrate the pending PR
<a href="https://github.com/ocaml-sf/learn-ocaml/pull/372">#372</a> that will solve a <a href="https://github.com/ocaml-sf/learn-ocaml/issues/316">long-running
issue</a> with auto-<code>Sync</code> and students-code overwriting; and we
also plan to extend learn-ocaml's backend and REST API soon to further enhance the UX of <b>learn-ocaml.el</b>, at least
to lift <a href="https://github.com/pfitaxel/learn-ocaml.el/blob/master/README.md#known-limitations">this limitation</a> (for
which we have a working proof-of-concept to be refined).
</p>

<p>
If need be, feel free to open issues in the <a href="https://github.com/ocaml-sf/learn-ocaml/issues/new/choose">Learn-OCaml bug tracker
(GH)</a> or post in this thread to share thoughts or
experience-feedback.
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Release of odoc 2.0.0</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-release-of-odoc-2-0-0/8582/1">https://discuss.ocaml.org/t/ann-release-of-odoc-2-0-0/8582/1</a>
</p>
</div>
