2021.10.12.txt


Erik Martin-Dorel announced
───────────────────────────

  We are very pleased to announce the immediate availability of the
  latest stable release of [Learn-OCaml], version `0.13.0'.

  Many thanks to all users and developers that reported bugs,
  contributed features or patches ✨ and in particular, special thanks
  go to @yurug and @AltGr for their precious advice and help during the
  preparation of this release.

  A (mostly) comprehensive list of the features, fixes, and enhancements
  offered by this release is available in [the Release Notes].

  Beyond this list of changes, note that:

  • We now switch to *semantic versioning*, so that this version is
    git-tagged `v0.13.0' and not just `0.13'.
  • The REST API did *not* change (between the previous stable version
    0.12 and version 0.13.0).
  • The *"exodir" format* has been slightly extended (but the
    [documentation online] of these changes is not yet up-to-date),
    keeping a strong focus on backward-compatibility (see e.g. [PR #397]
    for related remarks).
  • All the main *binaries of Learn-OCaml* (`learn-ocaml-client',
    `learn-ocaml', and the native `learn-ocaml-server') are now
    statically built and available in the [*Release page*], for Linux
    and macOS.
  • The whole codebase of Learn-OCaml has been ported to *OCaml 4.12*
    (including the toplevel environment that is exposed to students).
  • We now *relax the coupling between client/server*, and commit to
    *keeping backward-compatibility* for the latest `learn-ocaml-client'
    w.r.t. the previous versions (so, `learn-ocaml-client.0.13.0' can
    interact with servers `learn-ocaml.{0.12, 0.13.0}' smoothly − see
    [PR #426] for context).
  • The `learn-ocaml-client' CLI API did not change, except that a
    command *`learn-ocaml-client server-version'* has been added, to
    distinguish between the server version and the (possibly more
    recent) `learn-ocaml-client --version' (see [PR #429] for details).
  • Docker images are still available on [*Docker Hub*], e.g., to easily
    spin a local server from a repository exercises, you can do:
    ┌────
    │ sudo docker run --name=server-test -v "$PWD/demo-repository:/repository:ro" \
    │   -p 8080:8080 ocamlsf/learn-ocaml:0.13.0
    └────
    More details on the Docker setup can be found in [How to deploy a
    learn-ocaml instance].
  • (If you migrate from `0.12' to `0.13.0' in your deployments, beware
    that the mere bump of OCaml's version may cause some of your graders
    to fail.)
  • A [dedicated PR] has also been opened in *opam-repository*.
  • As noted above, several architectural changes have been done about
    the `learn-ocaml-client' as this tool plays a
  key "pivot" role, for students that would like to use
  *Tuareg+Merlin+[learn-ocaml-mode]* and interact with a Learn-OCaml
  server backend directly from Emacs (and thus benefit from the
  advantages of both Merlin and Learn-OCaml's exercise grading feature).

  We hope to be able to release 0.14.0 soon, specifically to integrate
  the pending PR [#372] that will solve a [long-running issue] with
  auto-`Sync' and students-code overwriting; and we also plan to extend
  learn-ocaml's backend and REST API soon to further enhance the UX of
  *learn-ocaml.el*, at least to lift [this limitation] (for which we
  have a working proof-of-concept to be refined).

  If need be, feel free to open issues in the [Learn-OCaml bug tracker
  (GH)] or post in this thread to share thoughts or experience-feedback.


[Learn-OCaml] <https://github.com/ocaml-sf/learn-ocaml>

[the Release Notes]
<https://github.com/ocaml-sf/learn-ocaml/releases/tag/v0.13.0>

[documentation online]
<https://ocaml-sf.org/learn-ocaml/tutorials/step-0.html>

[PR #397] <https://github.com/ocaml-sf/learn-ocaml/pull/397>

[*Release page*] <https://github.com/ocaml-sf/learn-ocaml/releases/>

[PR #426] <https://www.github.com/ocaml-sf/learn-ocaml/issues/426>

[PR #429] <https://github.com/ocaml-sf/learn-ocaml/pull/429>

[*Docker Hub*] <https://hub.docker.com/r/ocamlsf/learn-ocaml>

[How to deploy a learn-ocaml instance]
<https://ocaml-sf.org/learn-ocaml/howto-deploy-a-learn-ocaml-instance.html>

[dedicated PR] <https://github.com/ocaml/opam-repository/pull/19698>

[learn-ocaml-mode] <https://github.com/pfitaxel/learn-ocaml.el>

[#372] <https://github.com/ocaml-sf/learn-ocaml/pull/372>

[long-running issue]
<https://github.com/ocaml-sf/learn-ocaml/issues/316>

[this limitation]
<https://github.com/pfitaxel/learn-ocaml.el/blob/master/README.md#known-limitations>

[Learn-OCaml bug tracker (GH)]
<https://github.com/ocaml-sf/learn-ocaml/issues/new/choose>


Release of odoc 2.0.0
═════════════════════

  Archive:
  <https://discuss.ocaml.org/t/ann-release-of-odoc-2-0-0/8582/1>


Jon Ludlam announced
────────────────────
