2021.10.12.html

<div id="outline-container-org9f4c087" class="outline-3">
<h3 id="org9f4c087">Jon Ludlam announced</h3>
<div class="outline-text-3" id="text-org9f4c087">
<p>
Hot on the heels of the OCaml 4.13 announcement(s!), the <code>odoc</code> team is pleased to announce the release of <code>odoc
2.0.0</code>!
</p>

<p>
<b>tl;dr:</b>
The new version produces <a href="https://ocaml-doc.github.io/odoc-examples/core_kernel/Core_kernel/Bigbuffer/index.html">much better
output</a> than <a href="https://ocaml.janestreet.com/ocaml-core/latest/doc/core_kernel/Core_kernel/Bigbuffer/index.html">the old
version</a>, it's the
engine at the core of the package docs in <a href="https://v3.ocaml.org/packages">v3.ocaml.org</a>, and it also has a <a href="https://ocaml.github.io/odoc">new
website</a>.
</p>

<p>
This release has been a long time coming &#x2013; years! &#x2013; and contains several notable improvements over the <code>odoc 1.5</code>
series: a new language model, a new rendering layer allowing output in several formats, and improved control over the
output structure.
</p>
</div>

<div id="outline-container-org02eb418" class="outline-4">
<h4 id="org02eb418">New Features</h4>
<div class="outline-text-4" id="text-org02eb418">
</div>
<div id="outline-container-org350d2dd" class="outline-5">
<h5 id="org350d2dd">New Language Model</h5>
<div class="outline-text-5" id="text-org350d2dd">
<p>
The internal library used by <code>odoc</code> that models the OCaml module system has been completely rewritten over a
multi-year effort by @jonludlam and @Julow, according to a design by @lpw25. The rewrite gives <code>odoc</code> a much better
understanding of the module system compared to the original implementation. This library is used for two main
processes:
</p>

<ol class="org-ol">
<li><p>
To perform <span class="underline">expansions</span>, which is the process where <code>odoc</code> takes complex module type expressions like <a href="https://ocaml.github.io/odoc/deps/tyxml/Html_f/index.html#module-Make">this one from tyxml</a>:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">Make</span>
    <span style="color: #a0522d;">(Xml : </span><span style="color: #228b22;">Xml_sigs.T </span><span style="color: #000000; font-weight: bold;">with type</span><span style="color: #228b22;"> ('a, 'b) W.ft = 'a -&gt; 'b</span><span style="color: #a0522d;">)</span>
<span style="color: #a0522d;">    (Svg : </span><span style="color: #228b22;">Svg_sigs.T </span><span style="color: #000000; font-weight: bold;">with module</span><span style="color: #228b22;"> Xml := Xml</span><span style="color: #a0522d;">)</span>
<span style="color: #a0522d;">  </span>: <span style="color: #228b22;">Html_sigs.Make(Xml)(Svg).T</span>
    <span style="color: #000000; font-weight: bold;">with type</span> <span style="color: #228b22;">+'a elt</span> = <span style="color: #228b22;">Xml.</span>elt
     <span style="color: #000000; font-weight: bold;">and type</span> <span style="color: #228b22;">+'a attrib</span> = <span style="color: #228b22;">Xml.</span>attrib
</pre>
</div>
<p>
Then turns it into an <a href="https://ocaml.github.io/odoc/deps/tyxml/Html_f/Make/index.html">output page</a> containing the correct types, values, modules, includes, and documentation.
</p></li>

<li><p>
To perform <b>resolutions</b>, which is where <code>odoc</code> handles complex paths found in OCaml source in order to calculate the correct definition link. For example, in the following snippet:
</p>
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">module type</span> <span style="color: #228b22;">A</span> = <span style="color: #000000; font-weight: bold;">sig</span>
  <span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">M</span> : <span style="color: #000000; font-weight: bold;">sig</span> <span style="color: #000000; font-weight: bold;">module type</span> <span style="color: #228b22;">S</span> <span style="color: #000000; font-weight: bold;">end</span>
  <span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">N</span> : <span style="color: #228b22;">M.S</span>
<span style="color: #000000; font-weight: bold;">end</span>

<span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">B</span> : <span style="color: #000000; font-weight: bold;">sig</span> <span style="color: #000000; font-weight: bold;">module type</span> <span style="color: #228b22;">S</span> = <span style="color: #000000; font-weight: bold;">sig</span> <span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">t</span> <span style="color: #000000; font-weight: bold;">end</span> <span style="color: #000000; font-weight: bold;">end</span>

<span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">C</span> : <span style="color: #228b22;">A</span> <span style="color: #000000; font-weight: bold;">with module</span> <span style="color: #228b22;">M</span> = <span style="color: #228b22;">B</span> <span style="color: #000000; font-weight: bold;">with type</span> <span style="color: #228b22;">N.t</span> = int

<span style="color: #000000; font-weight: bold;">type</span> <span style="color: #228b22;">t</span> = <span style="color: #228b22;">C.N.</span>t
</pre>
</div>
<p>
resolution is the process by which <code>odoc</code> determines which documentation page to take you when you click on <code>C.N.t</code>.
</p></li>
</ol>

<p>
The new model has logic to handle many features of the OCaml language, as can be explored
<a href="http://ocaml.github.io/odoc/features.html">here</a>.
</p>

<p>
A particularly important improvement is in handling canonical modules (explained in the link above). The upshot of
this is that there should never be any more odd double underscores leaking into your docs!
</p>

<p>
For some more info on this, as well as the new output renderers, see <a href="https://watch.ocaml.org/videos/watch/2acebff9-25fa-4733-83cc-620a65b12251">our talk at the OCaml workshop last
year</a>
</p>
</div>
</div>

<div id="outline-container-orga9f382f" class="outline-5">
<h5 id="orga9f382f">New Output Renderers</h5>
<div class="outline-text-5" id="text-orga9f382f">
<p>
@Drup put a considerable amount of work into replacing the <code>odoc 1.5</code> custom HTML generator  with a new rendering
layer. This features a new intermediate format allowing new output formats to be added far more easily than before.
</p>

<p>
Included in <code>odoc 2.0</code> are renderers for HTML and man pages (both contributed by @Drup) and LaTeX (contributed by
@Octachron). The LaTeX renderer has already been integrated into the OCaml build process to generate docs (see
<a href="https://github.com/ocaml/ocaml/pull/9997">https://github.com/ocaml/ocaml/pull/9997</a> and related PRs). @jonludlam also made an alternative HTML renderer designed
specifically for <a href="https://v3.ocaml.org/packages">v3.ocaml.org</a>. Finally, a new markdown renderer is being prepared by
@lubega-simon and should land in the next release.
</p>

<p>
We look forward to many new renderers being created for the varied use cases present in the community!
</p>
</div>
</div>
