2021.10.12.txt

  Hot on the heels of the OCaml 4.13 announcement(s!), the `odoc' team
  is pleased to announce the release of `odoc 2.0.0'!

  *tl;dr:* The new version produces [much better output] than [the old
  version], it's the engine at the core of the package docs in
  [v3.ocaml.org], and it also has a [new website].

  This release has been a long time coming – years! – and contains
  several notable improvements over the `odoc 1.5' series: a new
  language model, a new rendering layer allowing output in several
  formats, and improved control over the output structure.


[much better output]
<https://ocaml-doc.github.io/odoc-examples/core_kernel/Core_kernel/Bigbuffer/index.html>

[the old version]
<https://ocaml.janestreet.com/ocaml-core/latest/doc/core_kernel/Core_kernel/Bigbuffer/index.html>

[v3.ocaml.org] <https://v3.ocaml.org/packages>

[new website] <https://ocaml.github.io/odoc>

New Features
╌╌╌╌╌╌╌╌╌╌╌╌

New Language Model
┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄

  The internal library used by `odoc' that models the OCaml module
  system has been completely rewritten over a multi-year effort by
  @jonludlam and @Julow, according to a design by @lpw25. The rewrite
  gives `odoc' a much better understanding of the module system compared
  to the original implementation. This library is used for two main
  processes:

  1. To perform _expansions_, which is the process where `odoc' takes
     complex module type expressions like [this one from tyxml]:
     ┌────
     │ module Make
     │     (Xml : Xml_sigs.T with type ('a, 'b) W.ft = 'a -> 'b)
     │     (Svg : Svg_sigs.T with module Xml := Xml)
     │   : Html_sigs.Make(Xml)(Svg).T
     │     with type +'a elt = Xml.elt
     │      and type +'a attrib = Xml.attrib
     └────
     Then turns it into an [output page] containing the correct types,
     values, modules, includes, and documentation.

  2. To perform *resolutions*, which is where `odoc' handles complex
     paths found in OCaml source in order to calculate the correct
     definition link. For example, in the following snippet:
     ┌────
     │ module type A = sig
     │   module M : sig module type S end
     │   module N : M.S
     │ end
     │ 
     │ module B : sig module type S = sig type t end end
     │ 
     │ module C : A with module M = B with type N.t = int
     │ 
     │ type t = C.N.t
     └────
     resolution is the process by which `odoc' determines which
     documentation page to take you when you click on `C.N.t'.

  The new model has logic to handle many features of the OCaml language,
  as can be explored [here].

  A particularly important improvement is in handling canonical modules
  (explained in the link above). The upshot of this is that there should
  never be any more odd double underscores leaking into your docs!

  For some more info on this, as well as the new output renderers, see
  [our talk at the OCaml workshop last year]


[this one from tyxml]
<https://ocaml.github.io/odoc/deps/tyxml/Html_f/index.html#module-Make>

[output page]
<https://ocaml.github.io/odoc/deps/tyxml/Html_f/Make/index.html>

[here] <http://ocaml.github.io/odoc/features.html>

[our talk at the OCaml workshop last year]
<https://watch.ocaml.org/videos/watch/2acebff9-25fa-4733-83cc-620a65b12251>


New Output Renderers
┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄

  @Drup put a considerable amount of work into replacing the `odoc 1.5'
  custom HTML generator with a new rendering layer. This features a new
  intermediate format allowing new output formats to be added far more
  easily than before.

  Included in `odoc 2.0' are renderers for HTML and man pages (both
  contributed by @Drup) and LaTeX (contributed by @Octachron). The LaTeX
  renderer has already been integrated into the OCaml build process to
  generate docs (see <https://github.com/ocaml/ocaml/pull/9997> and
  related PRs). @jonludlam also made an alternative HTML renderer
  designed specifically for [v3.ocaml.org]. Finally, a new markdown
  renderer is being prepared by @lubega-simon and should land in the
  next release.

  We look forward to many new renderers being created for the varied use
  cases present in the community!


[v3.ocaml.org] <https://v3.ocaml.org/packages>


Output Structure
┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
