2021.10.12.org
**** Output Structure

~odoc 2.0~ introduces a new mechanism to specify the structure of the files produced. Although it's a relatively
simple new feature, it nevertheless has enabled ~odoc~ to be used in new ways. In particular, it has allowed ~odoc~
to construct the
package documentation for the new OCaml website, [[https://v3.ocaml.org/packages][v3.ocaml.org]]. There is also an
[[https://ocaml.github.io/odoc/driver.html][example driver]], showing how ~odoc~ can be used to construct a stand-alone
website for an OCaml package that contains fully-linked documentation for a package and all of its dependencies. This
has been used to create ~odoc~'s [[https://ocaml.github.io/odoc][new website]].

**** New Drivers

Like the OCaml compiler itself, running ~odoc~ on your code requires careful sequencing of the invocations to produce
the correct result. Fortunately both ~dune~ and ~odig~ understand how to do this, so most users don't need to know
the details. If you want more than these tools provide though, we've written a simple [[https://ocaml.github.io/odoc/driver.html][reference
driver]], documenting exactly what's necessary to use ~odoc~ to produce rich
documentation. A more complete (and more complex) example is the tool [[https://github.com/ocaml-doc/voodoo][voodoo]],
which is being used to create the docs for [[https://v3.ocaml.org/packages][v3.ocaml.org]].

*** [[https://v3.ocaml.org][v3.ocaml.org]]

As previously posted, the new version of the OCaml website has been under development for some time now, and an
important new feature is the integration of package listings, including documentation for every version of every
package. More has been written about this elsewhere, but it's important to note that the new OCaml.org website
required a preview version of ~odoc 2.0~ to work. We've made a few bug fixes since then, so we will update the
pipeline to use the released version very soon. For more info on the pipeline to build the docs, see [[https://watch.ocaml.org/videos/watch/9bb452d6-1829-4dac-a6a2-46b31050c931][our recent
talk]] at this year's OCaml Workshop.

*** New Website

The website for ~odoc~ has been improved with guides for [[https://ocaml.github.io/odoc/odoc_for_authors.html][documentation
authors]],
[[https://ocaml.github.io/odoc/driver.html][integrators]], and
[[https://ocaml.github.io/odoc/contributors.html][contributors]]. This site is intended to grow over time with more
content to help people write docs for their packages.

*** OCamldoc?

This release, particularly because of the new output renderers, puts ~odoc~ in a place where it supercedes OCamldoc
in most respects. There are a few features we're missing (see [[https://ocaml.github.io/odoc/ocamldoc_differences.html][the
comparison]] in the docs), including
most notably that we don't render the source (OCamldoc's ~--keep-code~ argument), and that there is no support for
custom tags. If ~odoc~ is lacking features that you're currently relying on in OCamldoc, we'd love to hear from you!

*** More Docs!

Finally, I'd like to use this opportunity to launch an invitation. With [[https://v3.ocaml.org/packages][v3.ocaml.org]]
now showing all the package docs in their current state, I'd like to invite all our package authors, maintainers,
contributors, and users to take a look over their favourite packages and see what the documentation looks like. Good
documentation is one of the [[https://discuss.ocaml.org/t/suggestions-from-the-ocaml-survey-result/6791][most important
requests]] from the previous OCaml
developer surveys, and with [[https://v3.ocaml.org/][v3.ocaml.org]] as a new documentation hub, now is a great time to
be making improvements where they're required. With this new release of ~odoc~, previewing your docs should be as
simple as ~dune build @doc~.

Some packages already have great docs - a few examples are:

- [[https://v3.ocaml.org/p/brr/0.0.1/doc/ffi_manual.html][brr]]
- [[https://v3.ocaml.org/p/lwt/5.4.2/doc/index.html][lwt]]
- [[https://v3.ocaml.org/p/mimic/0.0.3/doc/index.html][mimic]]
- [[https://v3.ocaml.org/p/streaming/0.8.0/doc/index.html][streaming]]
- [[https://v3.ocaml.org/p/uucp/13.0.0/doc/index.html][uucp]]

many others have more patchy docs. Let's fix that!

We're also looking for more contributors to ~odoc~. It's much improved now, but there's still [[https://github.org/ocaml/odoc/issues][plenty more to
do]]. Come and join the fun!
      



* The road to OCaml 5.0
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/the-road-to-ocaml-5-0/8584/1

