2021.10.12.html

<div id="outline-container-org7a52417" class="outline-5">
<h5 id="org7a52417">Output Structure</h5>
<div class="outline-text-5" id="text-org7a52417">
<p>
<code>odoc 2.0</code> introduces a new mechanism to specify the structure of the files produced. Although it's a relatively
simple new feature, it nevertheless has enabled <code>odoc</code> to be used in new ways. In particular, it has allowed <code>odoc</code>
to construct the
package documentation for the new OCaml website, <a href="https://v3.ocaml.org/packages">v3.ocaml.org</a>. There is also an
<a href="https://ocaml.github.io/odoc/driver.html">example driver</a>, showing how <code>odoc</code> can be used to construct a stand-alone
website for an OCaml package that contains fully-linked documentation for a package and all of its dependencies. This
has been used to create <code>odoc</code>'s <a href="https://ocaml.github.io/odoc">new website</a>.
</p>
</div>
</div>

<div id="outline-container-org6e0d097" class="outline-5">
<h5 id="org6e0d097">New Drivers</h5>
<div class="outline-text-5" id="text-org6e0d097">
<p>
Like the OCaml compiler itself, running <code>odoc</code> on your code requires careful sequencing of the invocations to produce
the correct result. Fortunately both <code>dune</code> and <code>odig</code> understand how to do this, so most users don't need to know
the details. If you want more than these tools provide though, we've written a simple <a href="https://ocaml.github.io/odoc/driver.html">reference
driver</a>, documenting exactly what's necessary to use <code>odoc</code> to produce rich
documentation. A more complete (and more complex) example is the tool <a href="https://github.com/ocaml-doc/voodoo">voodoo</a>,
which is being used to create the docs for <a href="https://v3.ocaml.org/packages">v3.ocaml.org</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org5bf222b" class="outline-4">
<h4 id="org5bf222b"><a href="https://v3.ocaml.org">v3.ocaml.org</a></h4>
<div class="outline-text-4" id="text-org5bf222b">
<p>
As previously posted, the new version of the OCaml website has been under development for some time now, and an
important new feature is the integration of package listings, including documentation for every version of every
package. More has been written about this elsewhere, but it's important to note that the new OCaml.org website
required a preview version of <code>odoc 2.0</code> to work. We've made a few bug fixes since then, so we will update the
pipeline to use the released version very soon. For more info on the pipeline to build the docs, see <a href="https://watch.ocaml.org/videos/watch/9bb452d6-1829-4dac-a6a2-46b31050c931">our recent
talk</a> at this year's OCaml Workshop.
</p>
</div>
</div>

<div id="outline-container-org93186c9" class="outline-4">
<h4 id="org93186c9">New Website</h4>
<div class="outline-text-4" id="text-org93186c9">
<p>
The website for <code>odoc</code> has been improved with guides for <a href="https://ocaml.github.io/odoc/odoc_for_authors.html">documentation
authors</a>,
<a href="https://ocaml.github.io/odoc/driver.html">integrators</a>, and
<a href="https://ocaml.github.io/odoc/contributors.html">contributors</a>. This site is intended to grow over time with more
content to help people write docs for their packages.
</p>
</div>
</div>

<div id="outline-container-org2ac9fec" class="outline-4">
<h4 id="org2ac9fec">OCamldoc?</h4>
<div class="outline-text-4" id="text-org2ac9fec">
<p>
This release, particularly because of the new output renderers, puts <code>odoc</code> in a place where it supercedes OCamldoc
in most respects. There are a few features we're missing (see <a href="https://ocaml.github.io/odoc/ocamldoc_differences.html">the
comparison</a> in the docs), including
most notably that we don't render the source (OCamldoc's <code>--keep-code</code> argument), and that there is no support for
custom tags. If <code>odoc</code> is lacking features that you're currently relying on in OCamldoc, we'd love to hear from you!
</p>
</div>
</div>

<div id="outline-container-org5b1f669" class="outline-4">
<h4 id="org5b1f669">More Docs!</h4>
<div class="outline-text-4" id="text-org5b1f669">
<p>
Finally, I'd like to use this opportunity to launch an invitation. With <a href="https://v3.ocaml.org/packages">v3.ocaml.org</a>
now showing all the package docs in their current state, I'd like to invite all our package authors, maintainers,
contributors, and users to take a look over their favourite packages and see what the documentation looks like. Good
documentation is one of the <a href="https://discuss.ocaml.org/t/suggestions-from-the-ocaml-survey-result/6791">most important
requests</a> from the previous OCaml
developer surveys, and with <a href="https://v3.ocaml.org/">v3.ocaml.org</a> as a new documentation hub, now is a great time to
be making improvements where they're required. With this new release of <code>odoc</code>, previewing your docs should be as
simple as <code>dune build @doc</code>.
</p>

<p>
Some packages already have great docs - a few examples are:
</p>

<ul class="org-ul">
<li><a href="https://v3.ocaml.org/p/brr/0.0.1/doc/ffi_manual.html">brr</a></li>
<li><a href="https://v3.ocaml.org/p/lwt/5.4.2/doc/index.html">lwt</a></li>
<li><a href="https://v3.ocaml.org/p/mimic/0.0.3/doc/index.html">mimic</a></li>
<li><a href="https://v3.ocaml.org/p/streaming/0.8.0/doc/index.html">streaming</a></li>
<li><a href="https://v3.ocaml.org/p/uucp/13.0.0/doc/index.html">uucp</a></li>
</ul>

<p>
many others have more patchy docs. Let's fix that!
</p>

<p>
We're also looking for more contributors to <code>odoc</code>. It's much improved now, but there's still <a href="https://github.org/ocaml/odoc/issues">plenty more to
do</a>. Come and join the fun!
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">The road to OCaml 5.0</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/the-road-to-ocaml-5-0/8584/1">https://discuss.ocaml.org/t/the-road-to-ocaml-5-0/8584/1</a>
</p>
</div>
