2021.10.12.html

<div id="outline-container-orgf9284db" class="outline-3">
<h3 id="orgf9284db">octachron announced</h3>
<div class="outline-text-3" id="text-orgf9284db">
<p>
With the convergence between the multicore and standard runtime across OCaml 4.10.0 to 4.13.0, the development of
OCaml multicore has reached a point where further integration into OCaml's main branch requires fully committing to a
switch to OCaml multicore.
</p>

<p>
The OCaml team has decided that the time has come for such a commitment.  The new major version, OCaml 5, will be a
multicore version of OCaml.  Moreover, OCaml 4.14 will be the last minor release of the 4.x series of OCaml.
</p>
</div>

<div id="outline-container-org01095ff" class="outline-4">
<h4 id="org01095ff">Multicore Minimum Viable Product</h4>
<div class="outline-text-4" id="text-org01095ff">
<p>
The first version of OCaml multicore, code-named OCaml 5.0, will be a Minimum Viable Product focused on:
</p>

<ul class="org-ul">
<li>x86-64</li>
<li>Linux, MacOS, Windows mingw-w64</li>
<li>Parallelism through Domains [1]</li>
<li>Concurrency through Effect Handlers [2] (without syntactic support and exposed as functions from the standard library)</li>
</ul>

<p>
Our plan is to integrate the multicore branch into the main branch during the next 6 months. Hopefully, OCaml 5.0
will then be released between March and April 2022.
</p>

<p>
Note that OCaml 5.0 focuses on minimal (solid) support for the multicore runtime system, and will not provide stable
user-facing concurrency and parallelism libraries. There has been a lot of experimentation ([3],[4]) in the last few
years, and some work remains to offer long-term, user-facing concurrent and parallel programming abstractions. OCaml
5.0 will be a great time to start adding concurrency and parallelism to your OCaml programs, but the libraries will
still be in flux.
</p>
</div>
</div>

<div id="outline-container-org9636da5" class="outline-4">
<h4 id="org9636da5">Long term support for OCaml 4.14</h4>
<div class="outline-text-4" id="text-org9636da5">
<p>
While OCaml 5 is stabilising, we plan to extend the support period for OCaml 4.14 by publishing minor bugfix releases
whenever needed. In particular, OCaml 4.14 will be supported until all tier-1 architectures and operating systems are
available in OCaml 5, and OCaml 5 sequential performance is close enough to that of OCaml 4.
</p>
</div>
</div>

<div id="outline-container-org09ce186" class="outline-4">
<h4 id="org09ce186">The sequential glaciation</h4>
<div class="outline-text-4" id="text-org09ce186">
<p>
To ensure that maintainers can concentrate on Multicore integration, and avoid any rebase work for the Multicore
developers, the trunk branch will be feature-frozen starting from November 2021. All non-bugfix non-multicore
contributions will be delayed to after the Multicore integration. We are calling this period the "sequential
glaciation".
</p>

<p>
We understand that this may be frustrating for our contributors, and apologize for the delay in getting your nice
work reviewed and merged into the codebase. We hope that the sequential glaciation will be a good opportunity to help
with the Multicore integration, review and testing, and/or focus on non-core-compiler efforts and the rest of the
OCaml ecosystem.
</p>

<p>
With this early feature-freeze, we also plan to release OCaml 4.14.0 in advance, between January and February 2022,
reducing the concurrency between the OCaml 5.0 and OCaml 4.14.0 releases.
</p>
</div>
</div>

<div id="outline-container-orgec26323" class="outline-4">
<h4 id="orgec26323">References</h4>
<div class="outline-text-4" id="text-orgec26323">
<ul class="org-ul">
<li>[1] "Retrofitting Parallelism onto OCaml", ICFP 2020, <a href="https://arxiv.org/abs/2004.11663">https://arxiv.org/abs/2004.11663</a></li>
<li>[2] "Retrofitting Concurrency onto OCaml", PLDI 2021, <a href="https://arxiv.org/abs/2104.00250">https://arxiv.org/abs/2104.00250</a></li>
<li>[3] Domainslib &#x2013; Parallel Programming over Multicore OCaml, <a href="https://github.com/ocaml-multicore/domainslib">https://github.com/ocaml-multicore/domainslib</a></li>
<li>[4] eio &#x2013; Effects-based Parallel IO for OCaml, <a href="https://github.com/ocaml-multicore/eio">https://github.com/ocaml-multicore/eio</a></li>
</ul>
</div>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">Become an Outreachy Mentor: support the growth and diversity of the OCaml community</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/become-an-outreachy-mentor-support-the-growth-and-diversity-of-the-ocaml-community/8213/14">https://discuss.ocaml.org/t/become-an-outreachy-mentor-support-the-growth-and-diversity-of-the-ocaml-community/8213/14</a>
</p>
</div>

<div id="outline-container-orge0ea2d3" class="outline-3">
<h3 id="orge0ea2d3">Deep in this thread, Jon Ludlam announced</h3>
<div class="outline-text-3" id="text-orge0ea2d3">
<p>
I've also submitted a project for the winter session: "Create a tool to show differences in the output of odoc."
</p>

<p>
The idea is to produce a tool to work on the output of the <a href="https://github.com/ocurrent/ocaml-docs-ci">ocaml-docs-ci
pipeline</a> to find differences between different versions of the same
package. We're aiming for it to eventually be used in the docs pages to highlight differences between versions in
<a href="https://v3.ocaml.org/">v3.ocaml.org</a>. Just one of the neat things we've got in mind for the docs pages on the new
website!
</p>

<p>
As @tmattio points out, you don't have to be a mentor to contribute to the process - so let the odoc team know if
you're interested in lending a hand.
</p>
</div>
</div>
</div>




<div id="outline-container-5" class="outline-2">
<h2 id="5">Windows-friendly OCaml 4.12 distribution 2nd preview release (0.2.0)</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-windows-friendly-ocaml-4-12-distribution-2nd-preview-release-0-2-0/8488/2">https://discuss.ocaml.org/t/ann-windows-friendly-ocaml-4-12-distribution-2nd-preview-release-0-2-0/8488/2</a>
</p>
</div>
