2021.10.12.org
** jbeckford announced


0.2.2 is now released.

Some of the bigger changes:
- (Bug Fixes) Many problems with Visual Studio have been resolved, especially for non-English installations.
- (Features) Pre-alpha support for macOS and Windows 32-bit, in addition to the existing Windows 64-bit support.
- (Reliability) There is now an [[https://github.com/diskuv/diskuv-ocaml-starter-ghmirror/actions/runs/1318976472][internal GitHub Actions CI system]] that builds Windows 32-bit, Windows 64-bit and macOS (x64). In the future GitHub Actions will be offered to anyone who needs to test their own 32-bit and 64-bit Windows packages.
- (Reliability) The Windows MinGW Opam repository vended by fdopen is still used but has been drastically pruned. Now the thousands of MinGW and DKML (MSVC) patches are pinned, and those pinned package versions are tested with the GitHub Actions CI system.

To upgrade, just follow the [[https://diskuv.gitlab.io/diskuv-ocaml/#two-step-installation-instructions][Two Step installation
instructions]] and then upgrade any of your
Local Projects like ~diskuv-ocaml-starter~ with ~./makeit build-dev~ .

The [[https://gitlab.com/diskuv/diskuv-ocaml/-/releases/v0.2.2#022-2021-10-07][v0.2.2 release notes]] has a detailed
list of changes.
      



* first release of osh: https://osh.ocamlpro.com
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/ann-first-release-of-osh-https-osh-ocamlpro-com/8594/1

** zapashcanon announced


I'm pleased to announce the first release of [[https://osh.ocamlpro.com][osh]], a website providing an API to generate
SVG badges.

E.g. this url: ~https://osh.ocamlpro.com/badge?label=build&color=green&status=passing~ will give the following
result: [[https://osh.ocamlpro.com/badge?label=build&color=green&status=passing][build passing]].

We also have special support for GitHub actions, using
~https://osh.ocamlpro.com/badge/github/workflow/status/OCamlPro/swhid/build.yml~ will give you the following: [[https://osh.ocamlpro.com/badge/github/workflow/status/OCamlPro/swhid/build.yml][build passing]].

Even when using the special GitHub action endpoint, you can override any parameter, e.g.
~https://osh.ocamlpro.com/badge/github/workflow/status/OCamlPro/swhid/build.yml?color=blue~ will give you the
following: [[https://osh.ocamlpro.com/badge/github/workflow/status/OCamlPro/swhid/build.yml?color=blue][build passing]].

We're willing to add any other special endpoint if someone is interested. :)

The [[https://gitlab.ocamlpro.com/OCamlPro/osh][source code is available on OCamlPro's Gitlab]], it's made with
[[https://github.com/OCamlPro/ocb][ocb]] for the badge generation part, [[https://github.com/aantron/dream][dream]],
[[https://github.com/c-cube/ezcurl][ezcurl]], [[https://github.com/ocaml/omd][omd]],
[[https://github.com/mirage/ocaml-crunch][crunch]] and [[https://github.com/ocaml-community/yojson][Yojson]].

There's also an [[https://opam.ocaml.org/packages/osh][opam package]] in case you want to host your own instance.

Enjoy !
      



* first release of pyast
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ann-first-release-of-pyast/8596/1

** Thierry Martinez announced


I have the pleasure to announce the first release of [[https://github.com/thierry-martinez/pyast/][pyast]], a library
provides versioned abstract syntax tree for all Python versions from Python 2.5 to Python 3.10.

Available on opam: ~opam install pyast~

The purpose of this library is very close to [[https://github.com/grievejia/pyre-ast][pyre-ast]], namely being able to
give access from OCaml programs to the Python own parser and to the ASTs it builds. There are two main differences:

- ~pyre-ast~ exposes the AST of Python 3.10 whereas ~pyast~ exposes the ASTs of all Python versions from Python 2.5 to Python 3.10 (in versioned modules _à la_ ocaml-migrate-parsetree), providing converters between them. The AST of the latest version of Python (currently, 3.10) is provided in ~Pyast.Latest~.

- ~pyre-ast~ embeds its own version of the Python interpreter, whereas ~pyast~ uses the Python interpreter available on the machine (via [[https://github.com/thierry-martinez/pyml/][pyml]]), converting the AST to the expected version if necessary.

The development of ~pyast~ was motivated when some handwritten code using
[[https://github.com/thierry-martinez/pyml/][pyml]] to access the Python parser broke after a Python upgrade because of
a change in the AST!
      



