2021.10.12.html

<div id="outline-container-org15faa51" class="outline-3">
<h3 id="org15faa51">jbeckford announced</h3>
<div class="outline-text-3" id="text-org15faa51">
<p>
0.2.2 is now released.
</p>

<p>
Some of the bigger changes:
</p>
<ul class="org-ul">
<li>(Bug Fixes) Many problems with Visual Studio have been resolved, especially for non-English installations.</li>
<li>(Features) Pre-alpha support for macOS and Windows 32-bit, in addition to the existing Windows 64-bit support.</li>
<li>(Reliability) There is now an <a href="https://github.com/diskuv/diskuv-ocaml-starter-ghmirror/actions/runs/1318976472">internal GitHub Actions CI system</a> that builds Windows 32-bit, Windows 64-bit and macOS (x64). In the future GitHub Actions will be offered to anyone who needs to test their own 32-bit and 64-bit Windows packages.</li>
<li>(Reliability) The Windows MinGW Opam repository vended by fdopen is still used but has been drastically pruned. Now the thousands of MinGW and DKML (MSVC) patches are pinned, and those pinned package versions are tested with the GitHub Actions CI system.</li>
</ul>

<p>
To upgrade, just follow the <a href="https://diskuv.gitlab.io/diskuv-ocaml/#two-step-installation-instructions">Two Step installation
instructions</a> and then upgrade any of your
Local Projects like <code>diskuv-ocaml-starter</code> with <code>./makeit build-dev</code> .
</p>

<p>
The <a href="https://gitlab.com/diskuv/diskuv-ocaml/-/releases/v0.2.2#022-2021-10-07">v0.2.2 release notes</a> has a detailed
list of changes.
</p>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">first release of osh: <a href="https://osh.ocamlpro.com">https://osh.ocamlpro.com</a></h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-first-release-of-osh-https-osh-ocamlpro-com/8594/1">https://discuss.ocaml.org/t/ann-first-release-of-osh-https-osh-ocamlpro-com/8594/1</a>
</p>
</div>

<div id="outline-container-org3916f19" class="outline-3">
<h3 id="org3916f19">zapashcanon announced</h3>
<div class="outline-text-3" id="text-org3916f19">
<p>
I'm pleased to announce the first release of <a href="https://osh.ocamlpro.com">osh</a>, a website providing an API to generate
SVG badges.
</p>

<p>
E.g. this url: <code>https://osh.ocamlpro.com/badge?label=build&amp;color=green&amp;status=passing</code> will give the following
result: <a href="https://osh.ocamlpro.com/badge?label=build&amp;color=green&amp;status=passing">build passing</a>.
</p>

<p>
We also have special support for GitHub actions, using
<code>https://osh.ocamlpro.com/badge/github/workflow/status/OCamlPro/swhid/build.yml</code> will give you the following: <a href="https://osh.ocamlpro.com/badge/github/workflow/status/OCamlPro/swhid/build.yml">build passing</a>.
</p>

<p>
Even when using the special GitHub action endpoint, you can override any parameter, e.g.
<code>https://osh.ocamlpro.com/badge/github/workflow/status/OCamlPro/swhid/build.yml?color=blue</code> will give you the
following: <a href="https://osh.ocamlpro.com/badge/github/workflow/status/OCamlPro/swhid/build.yml?color=blue">build passing</a>.
</p>

<p>
We're willing to add any other special endpoint if someone is interested. :)
</p>

<p>
The <a href="https://gitlab.ocamlpro.com/OCamlPro/osh">source code is available on OCamlPro's Gitlab</a>, it's made with
<a href="https://github.com/OCamlPro/ocb">ocb</a> for the badge generation part, <a href="https://github.com/aantron/dream">dream</a>,
<a href="https://github.com/c-cube/ezcurl">ezcurl</a>, <a href="https://github.com/ocaml/omd">omd</a>,
<a href="https://github.com/mirage/ocaml-crunch">crunch</a> and <a href="https://github.com/ocaml-community/yojson">Yojson</a>.
</p>

<p>
There's also an <a href="https://opam.ocaml.org/packages/osh">opam package</a> in case you want to host your own instance.
</p>

<p>
Enjoy !
</p>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">first release of pyast</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-first-release-of-pyast/8596/1">https://discuss.ocaml.org/t/ann-first-release-of-pyast/8596/1</a>
</p>
</div>

<div id="outline-container-org9c1df74" class="outline-3">
<h3 id="org9c1df74">Thierry Martinez announced</h3>
<div class="outline-text-3" id="text-org9c1df74">
<p>
I have the pleasure to announce the first release of <a href="https://github.com/thierry-martinez/pyast/">pyast</a>, a library
provides versioned abstract syntax tree for all Python versions from Python 2.5 to Python 3.10.
</p>

<p>
Available on opam: <code>opam install pyast</code>
</p>

<p>
The purpose of this library is very close to <a href="https://github.com/grievejia/pyre-ast">pyre-ast</a>, namely being able to
give access from OCaml programs to the Python own parser and to the ASTs it builds. There are two main differences:
</p>

<ul class="org-ul">
<li><code>pyre-ast</code> exposes the AST of Python 3.10 whereas <code>pyast</code> exposes the ASTs of all Python versions from Python 2.5 to Python 3.10 (in versioned modules <span class="underline">à la</span> ocaml-migrate-parsetree), providing converters between them. The AST of the latest version of Python (currently, 3.10) is provided in <code>Pyast.Latest</code>.</li>

<li><code>pyre-ast</code> embeds its own version of the Python interpreter, whereas <code>pyast</code> uses the Python interpreter available on the machine (via <a href="https://github.com/thierry-martinez/pyml/">pyml</a>), converting the AST to the expected version if necessary.</li>
</ul>

<p>
The development of <code>pyast</code> was motivated when some handwritten code using
<a href="https://github.com/thierry-martinez/pyml/">pyml</a> to access the Python parser broke after a Python upgrade because of
a change in the AST!
</p>
</div>
</div>
</div>
