2021.10.12.org
* Multiple open positions (postdoc, PhD, intern) on runtime verification at CEA LIST, France
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://sympa.inria.fr/sympa/arc/caml-list/2021-10/msg00010.html

** Julien Signoles announced


The Software Safety and Security Lab at CEA LIST (Université Paris-Saclay,
France) is opening 2 postdoc, 1 PhD, and 1 internship positions in the area
of runtime verification for code safety and security:

- postdoc: Designing Compilation Techniques for Improving Efficiency of E-ACSL, a Runtime Assertion Checker for C Programs https://julien-signoles.fr/positions/postdoc-eacsl.pdf

- postdoc: Control Flow Integrity for Remote Attestation https://julien-signoles.fr/positions/postdoc-cfi.pdf

- PhD: Outline Runtime Assertion Checking (possibly preceded by an internship on the same topic if needed) https://julien-signoles.fr/positions/phd-outline-rac.pdf

- internship: C Function Synthesis from Axiomatic Definitions (in French, please ask for an English version) https://julien-signoles.fr/positions/master_axiomatics.pdf

The candidates will:
- solve challenging research problems;
- implement their results in Frama-C, an industrial-strength open-source framework for analyses of C code;
- evaluate their solutions on concrete benchmarks or/and use cases;
- publish their results in international conferences and journals.

Strong knowledge in at least one of the following areas is always
appreciated:
- programming: OCaml and C, semantics of programming languages, ...
- formal verification: runtime verification, static analysis, ...
- compilation: code generation, program transformation, type system, ...

Interested applicants should send a CV and a motivation letter to Julien
Signoles (julien dot signoles at cea dot fr) as soon as possible.
      



* Postdoc position in Effect Handler Oriented Programming
:PROPERTIES:
:CUSTOM_ID: 9
:END:
Archive: https://discuss.ocaml.org/t/job-postdoc-position-in-effect-handler-oriented-programming/8597/1

** Daniel Hillerström announced


We have an opening for a post-doctoral research position at The
University of Edinburgh on Effect Handler Oriented Programming (EHOP)
funded by a UKRI Future Leaders Fellowship.

Candidates should have a background in programming languages with
experience of functional programming, formal semantics, and type
theory. Some experience with effect handlers and algebraic effects is
desirable, but not essential. The role will involve theory
(e.g. developing and reasoning about novel effect type systems
and algebraic theories) and practice (e.g. designing,
implementing, and evaluating implementations and applications of
effect handlers), and ample opportunity to engage with our
project partners (several of whom are deeply involved with the
development of OCaml).

The position is for three years starting in February 2022.

The EHOP project:

  https://effect-handlers.org/

Job application details:

https://elxw.fa.em3.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/2087/

If you are interested then feel free to contact [[mailto:sam.lindley@ed.ac.uk][Sam Lindley]] (application
deadline: 1 November 2021).
      



* OCaml compiler development newsletter, issue 3: June-September 2021
:PROPERTIES:
:CUSTOM_ID: 10
:END:
Archive: https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-3-june-september-2021/8598/1

** gasche announced


I’m happy to publish the third issue of the “OCaml compiler development newsletter”. (This is by no means exhaustive:
many people didn’t end up having the time to write something, and it’s fine.)

Feel free of course to comment or ask questions!

If you have been working on the OCaml compiler and want to say something, please feel free to post in this thread! If
you would like me to get in touch next time I prepare a newsletter issue (some random point in the future), please
let me know by email at (gabriel.scherer at gmail).

Previous issues:
- [[https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-2-may-2021/7965][OCaml compiler development newsletter, issue 2: May 2021]]
- [[https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-1-before-may-2021/7831][OCaml compiler development newsletter, issue 1: before May 2021]]

*** Nicolás Ojeda Bär (@nojb)

