2021.10.12.html




<div id="outline-container-8" class="outline-2">
<h2 id="8">Multiple open positions (postdoc, PhD, intern) on runtime verification at CEA LIST, France</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://sympa.inria.fr/sympa/arc/caml-list/2021-10/msg00010.html">https://sympa.inria.fr/sympa/arc/caml-list/2021-10/msg00010.html</a>
</p>
</div>

<div id="outline-container-org8566510" class="outline-3">
<h3 id="org8566510">Julien Signoles announced</h3>
<div class="outline-text-3" id="text-org8566510">
<p>
The Software Safety and Security Lab at CEA LIST (Université Paris-Saclay,
France) is opening 2 postdoc, 1 PhD, and 1 internship positions in the area
of runtime verification for code safety and security:
</p>

<ul class="org-ul">
<li>postdoc: Designing Compilation Techniques for Improving Efficiency of E-ACSL, a Runtime Assertion Checker for C Programs <a href="https://julien-signoles.fr/positions/postdoc-eacsl.pdf">https://julien-signoles.fr/positions/postdoc-eacsl.pdf</a></li>

<li>postdoc: Control Flow Integrity for Remote Attestation <a href="https://julien-signoles.fr/positions/postdoc-cfi.pdf">https://julien-signoles.fr/positions/postdoc-cfi.pdf</a></li>

<li>PhD: Outline Runtime Assertion Checking (possibly preceded by an internship on the same topic if needed) <a href="https://julien-signoles.fr/positions/phd-outline-rac.pdf">https://julien-signoles.fr/positions/phd-outline-rac.pdf</a></li>

<li>internship: C Function Synthesis from Axiomatic Definitions (in French, please ask for an English version) <a href="https://julien-signoles.fr/positions/master_axiomatics.pdf">https://julien-signoles.fr/positions/master_axiomatics.pdf</a></li>
</ul>

<p>
The candidates will:
</p>
<ul class="org-ul">
<li>solve challenging research problems;</li>
<li>implement their results in Frama-C, an industrial-strength open-source framework for analyses of C code;</li>
<li>evaluate their solutions on concrete benchmarks or/and use cases;</li>
<li>publish their results in international conferences and journals.</li>
</ul>

<p>
Strong knowledge in at least one of the following areas is always
appreciated:
</p>
<ul class="org-ul">
<li>programming: OCaml and C, semantics of programming languages, &#x2026;</li>
<li>formal verification: runtime verification, static analysis, &#x2026;</li>
<li>compilation: code generation, program transformation, type system, &#x2026;</li>
</ul>

<p>
Interested applicants should send a CV and a motivation letter to Julien
Signoles (julien dot signoles at cea dot fr) as soon as possible.
</p>
</div>
</div>
</div>




<div id="outline-container-9" class="outline-2">
<h2 id="9">Postdoc position in Effect Handler Oriented Programming</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/job-postdoc-position-in-effect-handler-oriented-programming/8597/1">https://discuss.ocaml.org/t/job-postdoc-position-in-effect-handler-oriented-programming/8597/1</a>
</p>
</div>

<div id="outline-container-org2b94514" class="outline-3">
<h3 id="org2b94514">Daniel Hillerström announced</h3>
<div class="outline-text-3" id="text-org2b94514">
<p>
We have an opening for a post-doctoral research position at The
University of Edinburgh on Effect Handler Oriented Programming (EHOP)
funded by a UKRI Future Leaders Fellowship.
</p>

<p>
Candidates should have a background in programming languages with
experience of functional programming, formal semantics, and type
theory. Some experience with effect handlers and algebraic effects is
desirable, but not essential. The role will involve theory
(e.g. developing and reasoning about novel effect type systems
and algebraic theories) and practice (e.g. designing,
implementing, and evaluating implementations and applications of
effect handlers), and ample opportunity to engage with our
project partners (several of whom are deeply involved with the
development of OCaml).
</p>

<p>
The position is for three years starting in February 2022.
</p>

<p>
The EHOP project:
</p>

<p>
<a href="https://effect-handlers.org/">https://effect-handlers.org/</a>
</p>

<p>
Job application details:
</p>

<p>
<a href="https://elxw.fa.em3.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/2087/">https://elxw.fa.em3.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CX_1001/job/2087/</a>
</p>

<p>
If you are interested then feel free to contact <a href="mailto:sam.lindley@ed.ac.uk">Sam Lindley</a> (application
deadline: 1 November 2021).
</p>
</div>
</div>
</div>




<div id="outline-container-10" class="outline-2">
<h2 id="10">OCaml compiler development newsletter, issue 3: June-September 2021</h2>
<div class="outline-text-2" id="text-10">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-3-june-september-2021/8598/1">https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-3-june-september-2021/8598/1</a>
</p>
</div>

<div id="outline-container-org76b02b4" class="outline-3">
<h3 id="org76b02b4">gasche announced</h3>
<div class="outline-text-3" id="text-org76b02b4">
<p>
I’m happy to publish the third issue of the “OCaml compiler development newsletter”. (This is by no means exhaustive:
many people didn’t end up having the time to write something, and it’s fine.)
</p>

<p>
Feel free of course to comment or ask questions!
</p>

<p>
If you have been working on the OCaml compiler and want to say something, please feel free to post in this thread! If
you would like me to get in touch next time I prepare a newsletter issue (some random point in the future), please
let me know by email at (gabriel.scherer at gmail).
</p>

<p>
Previous issues:
</p>
<ul class="org-ul">
<li><a href="https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-2-may-2021/7965">OCaml compiler development newsletter, issue 2: May 2021</a></li>
<li><a href="https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-1-before-may-2021/7831">OCaml compiler development newsletter, issue 1: before May 2021</a></li>
</ul>
</div>

<div id="outline-container-org64ce056" class="outline-4">
<h4 id="org64ce056">Nicolás Ojeda Bär (@nojb)</h4>
<div class="outline-text-4" id="text-org64ce056">
</div>
