2021.10.12.org
**** Channels in the standard library

- [[https://github.com/ocaml/ocaml/pull/10545][#10545]] Add modules ~In_channel~ and ~Out_channel~ to the standard library. (merged)

- [[https://github.com/ocaml/ocaml/pull/10538][#10538]] Add~Out_channel.set_buffered~ and ~Out_channel.is_buffered~ to control and query the buffering mode of output channels. (merged)

- [[https://github.com/ocaml/ocaml/pull/10596][#10596]] Add ~In_channel.input_all~, ~In_channel.with_open_{bin,text,gen}~ and ~Out_channel.with_open_{bin,text,gen}~. (under review)

**** Compiler user-interface

- [[https://github.com/ocaml/ocaml/pull/10654][#10654]] Propose an approach to enable use of debug info in bytecode binaries compiled with ~-output-complete-exe~. (waiting for review)
  This is the second iteration on work that could have important impact on usability of self-contained bytecode binaries -- bring ~-output-complete-exe~ to feature parity with ~-custom~, and deprecate the latter, more fragile approach.

- [[https://github.com/ocaml/ocaml/pull/10555][#10555]] Improve and clean up the AST locations stored associated to "punned" terms (eg ~{x; y}~ or ~< x; y >~). (merged)

- [[https://github.com/ocaml/ocaml/pull/10560][#10560]] The compiler now respects the ~NO_COLOR~ environment variable. (merged)

**** Internal changes

- [[https://github.com/ocaml/ocaml/pull/10624][#10624]] Apply a fix for a compile-time regression introduced in 4.08 (the fix was suggested by Leo White). (merged)

- [[https://github.com/ocaml/ocaml/pull/10606][#10606]] Clean up the implementation of the ~non-unit-statement~ and ~ignored-partial-application~ warnings. (merged)

*** David Allsopp (@dra27)

- Relocatable Compiler. I worked on the patchset in August and September. There's a prototype for both Windows and Unix rebased to 4.12 and 4.13. With these patches, if you have multiple versions of the compiler lying around (i.e. opam!), it is now virtually impossible for a bytecode executable to load the wrong C stubs library (e.g. ~dllunix.so~) or invoke the wrong version of ~ocamlrun~. Furthermore, from the compiler's perspective at least, a local opam switch can now be moved to a new location. The major thing this enables is the cloning of an existing compiler in order to create a new opam switch without any binary rewriting. With these patches, fresh local switches are building in 5-10 seconds (a lot of which is spent by opam, which has more incentive to be improved, now!).
- 4.13 includes the first parts of work to reduce the use of scripting languages in the build system   which improves the stability of the build system and also its portability. The Cygwin distribution   recently stopped distributing the ~iconv~ command by default, which broke all the Windows builds of OCaml (see [[https://github.com/ocam to a new location./ocaml/pull/10451][#10451]]. There's more work to go on this, but the rest of it is likely to be stalled until post OCaml 5.00. With the use of scripting vastly reduced, it was possible to get quite a long way through the build using _native Windows_-compiled GNU make (i.e. ~make.exe~ with no other dependencies) and no Cygwin/MSYS2/WSL.
- 4.13 includes a full overhaul of the FlexDLL bootstrap and detection (mentioned in my April update); hopefully gone are the days of randomly picking up the wrong flexlink or suddenly finding that FlexDLL is missing. The Windows build should also be appreciably faster when bootstrapping FlexDLL (which is what opam's source builds have to do).
- There's some ongoing work at "modernising" our use of POSIX to remove some older compatibility code in the Unix Library in [[https://github.com/ocaml/ocaml/pull/10505][#10505]]. It's always nice to _remove_ code!
- Gradually completing and closing down some of my more aged PRs, often replacing them with simpler implementations. It's funny how returning to PRs can often result in realising simpler approaches; like letting tea brew! :tea:

