2021.10.12.html
<div id="outline-container-org56aba97" class="outline-5">
<h5 id="org56aba97">Channels in the standard library</h5>
<div class="outline-text-5" id="text-org56aba97">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/pull/10545">#10545</a> Add modules <code>In_channel</code> and <code>Out_channel</code> to the standard library. (merged)</li>

<li><a href="https://github.com/ocaml/ocaml/pull/10538">#10538</a> Add~Out_channel.set_buffered~ and <code>Out_channel.is_buffered</code> to control and query the buffering mode of output channels. (merged)</li>

<li><a href="https://github.com/ocaml/ocaml/pull/10596">#10596</a> Add <code>In_channel.input_all</code>, <code>In_channel.with_open_{bin,text,gen}</code> and <code>Out_channel.with_open_{bin,text,gen}</code>. (under review)</li>
</ul>
</div>
</div>

<div id="outline-container-org6b168d5" class="outline-5">
<h5 id="org6b168d5">Compiler user-interface</h5>
<div class="outline-text-5" id="text-org6b168d5">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/pull/10654">#10654</a> Propose an approach to enable use of debug info in bytecode binaries compiled with <code>-output-complete-exe</code>. (waiting for review)
This is the second iteration on work that could have important impact on usability of self-contained bytecode binaries &#x2013; bring <code>-output-complete-exe</code> to feature parity with <code>-custom</code>, and deprecate the latter, more fragile approach.</li>

<li><a href="https://github.com/ocaml/ocaml/pull/10555">#10555</a> Improve and clean up the AST locations stored associated to "punned" terms (eg <code>{x; y}</code> or <code>&lt; x; y &gt;</code>). (merged)</li>

<li><a href="https://github.com/ocaml/ocaml/pull/10560">#10560</a> The compiler now respects the <code>NO_COLOR</code> environment variable. (merged)</li>
</ul>
</div>
</div>

<div id="outline-container-orge3aac80" class="outline-5">
<h5 id="orge3aac80">Internal changes</h5>
<div class="outline-text-5" id="text-orge3aac80">
<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/pull/10624">#10624</a> Apply a fix for a compile-time regression introduced in 4.08 (the fix was suggested by Leo White). (merged)</li>

<li><a href="https://github.com/ocaml/ocaml/pull/10606">#10606</a> Clean up the implementation of the <code>non-unit-statement</code> and <code>ignored-partial-application</code> warnings. (merged)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb64b705" class="outline-4">
<h4 id="orgb64b705">David Allsopp (@dra27)</h4>
<div class="outline-text-4" id="text-orgb64b705">
<ul class="org-ul">
<li>Relocatable Compiler. I worked on the patchset in August and September. There's a prototype for both Windows and Unix rebased to 4.12 and 4.13. With these patches, if you have multiple versions of the compiler lying around (i.e. opam!), it is now virtually impossible for a bytecode executable to load the wrong C stubs library (e.g. <code>dllunix.so</code>) or invoke the wrong version of <code>ocamlrun</code>. Furthermore, from the compiler's perspective at least, a local opam switch can now be moved to a new location. The major thing this enables is the cloning of an existing compiler in order to create a new opam switch without any binary rewriting. With these patches, fresh local switches are building in 5-10 seconds (a lot of which is spent by opam, which has more incentive to be improved, now!).</li>
<li>4.13 includes the first parts of work to reduce the use of scripting languages in the build system   which improves the stability of the build system and also its portability. The Cygwin distribution   recently stopped distributing the <code>iconv</code> command by default, which broke all the Windows builds of OCaml (see <a href="https://github.com/ocam%20to%20a%20new%20location./ocaml/pull/10451">#10451</a>. There's more work to go on this, but the rest of it is likely to be stalled until post OCaml 5.00. With the use of scripting vastly reduced, it was possible to get quite a long way through the build using <span class="underline">native Windows</span>-compiled GNU make (i.e. <code>make.exe</code> with no other dependencies) and no Cygwin/MSYS2/WSL.</li>
<li>4.13 includes a full overhaul of the FlexDLL bootstrap and detection (mentioned in my April update); hopefully gone are the days of randomly picking up the wrong flexlink or suddenly finding that FlexDLL is missing. The Windows build should also be appreciably faster when bootstrapping FlexDLL (which is what opam's source builds have to do).</li>
<li>There's some ongoing work at "modernising" our use of POSIX to remove some older compatibility code in the Unix Library in <a href="https://github.com/ocaml/ocaml/pull/10505">#10505</a>. It's always nice to <span class="underline">remove</span> code!</li>
<li>Gradually completing and closing down some of my more aged PRs, often replacing them with simpler implementations. It's funny how returning to PRs can often result in realising simpler approaches; like letting tea brew! :tea:</li>
</ul>
</div>
</div>
