2021.10.12.html

<div id="outline-container-orgd5a8aff" class="outline-4">
<h4 id="orgd5a8aff">Xavier Leroy (@xavierleroy)</h4>
<div class="outline-text-4" id="text-orgd5a8aff">
<p>
I worked on an old issue with the handling of tail calls by the native-code compiler: if there are many arguments to
the call and they don't all fit in the processor registers reserved for argument passing, the remaining arguments are
put on the stack, and a regular, non-tail call is performed.  This limitation had been with us since day 1 of OCaml.
I tried several times in the past to implement proper tail calls in the presence of arguments passed on stack, but
failed because of difficulties with the stack frame descriptors that are used by the GC to traverse the stack.
</p>

<p>
In <a href="https://github.com/ocaml/ocaml/pull/10595">#10595</a>, generalizing an earlier hack specific to the i386 port of
OCaml, I developed a simpler approach that uses memory from the "domain state" structure instead of the stack.  Once
the registers available for passing function arguments are exhausted, the next 64 arguments are passed in a memory
area that is part of the domain state. This argument passing is compatible with tail calls, so we get guaranteed tail
calls up to 70 arguments at least.
</p>

<p>
The domain state structure, introduced in preparation for merging Multicore OCaml, is a per-execution-domain memory
area that is efficiently addressable from a register. Hence, passing arguments through the domain state is safe
w.r.t. parallelism and about as efficient as passing them through the stack.
</p>

<p>
Enjoy your 70-arguments tail calls!
</p>
</div>
</div>

<div id="outline-container-org2e6ed71" class="outline-4">
<h4 id="org2e6ed71">Constructor unboxing (Nicolas Chataing @nchataing, Gabriel Scherer @gasche)</h4>
<div class="outline-text-4" id="text-org2e6ed71">
<p>
Nicolas Chataing's internship on constructor unboxing (mentioned in the <a href="https://discuss.ocaml.org/t/ocaml-compiler-development-newsletter-issue-2-may-2021/7965">last
issue</a> finished at the end
of June. We have been working on-and-off, at a slower rate, to get the prototype to the state we can submit a PR. The
first step was to propose our specification (which is different from Jeremy Yallop's original proposal), which is now
posted <a href="https://github.com/ocaml/RFCs/pull/14#issuecomment-920643103">as an RFC comment</a>.
</p>

<p>
Hacking on this topic produced a stream of small upstream PRs, mostly cleanups and refactorings that make our
implementation easier, and some documentation PRs for subtle aspects of the existing codebase we had to figure out
reading the code: <a href="https://github.com/ocaml/ocaml/pull/10500">#10500</a>,
<a href="https://github.com/ocaml/ocaml/pull/10512">#10512</a> (not yet merged, generating interesting discussion),
<a href="https://github.com/ocaml/ocaml/pull/10516">#10516</a>, <a href="https://github.com/ocaml/ocaml/pull/10637">#10637</a>,
<a href="https://github.com/ocaml/ocaml/pull/10646">#10646</a>.
</p>
</div>
</div>

<div id="outline-container-org0d85b48" class="outline-4">
<h4 id="org0d85b48">Vincent Laviron (@lthls(github)/@vlaviron(discuss))</h4>
<div class="outline-text-4" id="text-org0d85b48">
<p>
Léo Boitel's internship on detection and simplification of identity functions finished in June (find the
corresponding blog post <a href="https://www.ocamlpro.com/2021/07/16/detecting-identity-functions-in-flambda/">at OCamlPro</a>
and the discussion <a href="https://discuss.ocaml.org/t/detecting-identity-functions-in-flambda/8180">on Discuss</a>).
Pushing the results upstream isn't a priority right now, but I'm planning to build on that work and integrate it
either in the main compiler or in the Flambda 2 branch at some point in the future.
</p>

<p>
Apart from that, I've documented the abstract domains that we use for approximations in the Flambda 2 simplification
pass (you can find the result
<a href="https://github.com/ocaml-flambda/flambda-backend/blob/main/middle_end/flambda2/docs/types.md">here</a>), and I've
worked with Keryan Dider (@Keryan-dev) on an equivalent to the <code>-Oclassic</code> mode for Flambda 2.
</p>

<p>
I've also proposed and reviewed a number of small fixes both on the upstream and Flambda 2 repos, from fixes for
obscure bugs (like <a href="https://github.com/ocaml/ocaml/pull/10611">this Flambda bug</a>) to small improvements to code
generation.
</p>
</div>
</div>

<div id="outline-container-orgd5ac7c4" class="outline-4">
<h4 id="orgd5ac7c4">Jacques Garrigue (@garrigue)</h4>
<div class="outline-text-4" id="text-orgd5ac7c4">
<p>
Continued to work with Takafumi Saikawa (@t6s) on strengthening the datatypes used in the unification algorithm.
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/pull/10337">#10337</a> Make type nodes abstract, ensuring one always sees normal forms. Merged in June.</li>
<li><a href="https://github.com/ocaml/ocaml/pull/10474">#10474</a> Same thing for polymorphic variants rows. Merged in September.</li>
<li><a href="https://github.com/ocaml/ocaml/pull/10627">#10627</a> Same thing for polymorphic variant field kinds.</li>
<li><a href="https://github.com/ocaml/ocaml/pull/10541">#10541</a> Same thing for object field kinds and function commutation flags.</li>
</ul>

<p>
Also continued the work on creating a backend generating Coq code <a href="https://github.com/COCTI/ocaml/tree/ocaml_in_coq">GitHub - COCTI/ocaml at
ocaml_in_coq</a>. This now works with many examples.
</p>
</div>
</div>
</div>
</div>
