2021.10.12.org
* Odig 0.0.7, lookup documentation of installed OCaml packages
:PROPERTIES:
:CUSTOM_ID: 11
:END:
Archive: https://discuss.ocaml.org/t/ann-odig-0-0-7-lookup-documentation-of-installed-ocaml-packages/8600/1

** Daniel Bünzli announced


It's my pleasure to announce the release ~0.0.7~ of [[https://erratique.ch/software/odig][~odig~]]. Odig is a command
line tool to lookup documentation of installed OCaml packages.

Once it has made it to the repo, install with ~opam install ocaml-manual odig~ and consult the
[[https://erratique.ch/software/odig/doc/index][manual]] (or via ~odig doc odig~).

This release provides support for ~odoc~ 2.0.0. The [[https://github.com/b0-system/odig/blob/master/CHANGES.md#v007-2021-10-09-zagreb][release
notes]] have all the details.
      



* OCaml Café: Wed, Oct 13 @ 1pm (U.S. Central)
:PROPERTIES:
:CUSTOM_ID: 12
:END:
Archive: https://discuss.ocaml.org/t/ocaml-cafe-wed-oct-13-1pm-u-s-central/8610/1

** Michael Bacarella announced


*Note!* This is not our usual time! Past meetups have been at 7pm (U.S. Central). This one is happening at 1pm
(U.S. Central). This meetup should be easier for people in Europe to attend.

Please join us at the next OCaml Cafe, a friendly, low stakes opportunity to ask questions about the OCaml language
and ecosystem, work through programming problems that you’re stuck on, and get feedback on your code. Especially
geared toward new and intermediate users, experienced OCaml developers will be available to answer your questions.
Bring your code and we’ll be happy to review it, assist with debugging, and provide recommendations for improvement.

This month, David Allsop of OCaml Labs and the University of Cambridge will present on OPAM, the OCaml package
manager. After introducing OPAM, David will discuss the new features of OPAM 2.1, just released at the beginning of
August. Following David's talk, we will open the discussion to all things OCaml-related.

Full meeting details, including Zoom link, here:
https://www.meetup.com/ocaml-cafe/events/281344155/
      



* Multicore OCaml: September 2021, effect handlers will be in OCaml 5.0!
:PROPERTIES:
:CUSTOM_ID: 13
:END:
Archive: https://discuss.ocaml.org/t/multicore-ocaml-september-2021-effect-handlers-will-be-in-ocaml-5-0/8554/16

** Deep in this thread, Bikal Lem announced


The multicore [[https://github.com/ocaml-multicore/eio/pull/82][eio]] lib has now been migrated to the *syntax-free*
version. This is the version of effects which will be available in the upcoming OCaml 5.0.0.

PR : https://github.com/ocaml-multicore/eio/pull/82
      



* Alcotest 1.5.0
:PROPERTIES:
:CUSTOM_ID: 14
:END:
Archive: https://discuss.ocaml.org/t/ann-alcotest-1-5-0/8613/1

** Craig Ferguson announced


I’m pleased to announce the release of [[https://github.com/mirage/alcotest/][Alcotest ]] 1.5.0, now available on Opam.

This release includes:

- *JavaScript compatibility* ([[https://github.com/mirage/alcotest/pull/326][#326]]), via ~js_of_ocaml.3.11.0~. Projects that build with ~js_of_ocaml~ can now use the regular ~alcotest~ package to test their JavaScript-compatible libraries. For users of ~dune~, this is as easy as adding ~(modes ... js)~ to your ~test~ stanzas (to build the JavaScript targets) and a corresponding ~rule~ to run the output:

  #+begin_src lisp
  (test
   (name main)
   (modes native js)
   (libraries alcotest))

  (rule
   (alias runtest-js)
   (action
    (run node %{dep:main.bc.js})))
  #+end_src

  To depend on a version of ~js_of_ocaml~ that is supported by Alcotest, add a dependency on the the virtual package ~alcotest-js~.

  Many thanks @hhugo and @smorimoto for this excellent contribution!

- *Backtrace collection by default* ([[https://github.com/mirage/alcotest/pull/317][#317]]). The Alcotest runner now enables backtrace collection by default, ensuring that failing native tests always come with backtraces without any need to set ~OCAMLRUNPARAM=b~.

- *A stable ~Alcotest.V1~ module* ([[https://github.com/mirage/alcotest/pull/306][#306]]). This module is very similar to the existing top-level ~Alcotest~ module, but provides some stability guarantee across major versions. It's intended to provide a migration path for an eventual "Alcotest 2" to make improvements on the existing API.

The full changelog is available [[https://github.com/mirage/alcotest/releases/tag/1.5.0][here]].
      



* Other OCaml News
:PROPERTIES:
:CUSTOM_ID: 15
:END:
