2021.10.12.html




<div id="outline-container-11" class="outline-2">
<h2 id="11">Odig 0.0.7, lookup documentation of installed OCaml packages</h2>
<div class="outline-text-2" id="text-11">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-odig-0-0-7-lookup-documentation-of-installed-ocaml-packages/8600/1">https://discuss.ocaml.org/t/ann-odig-0-0-7-lookup-documentation-of-installed-ocaml-packages/8600/1</a>
</p>
</div>

<div id="outline-container-org4d6e630" class="outline-3">
<h3 id="org4d6e630">Daniel Bünzli announced</h3>
<div class="outline-text-3" id="text-org4d6e630">
<p>
It's my pleasure to announce the release <code>0.0.7</code> of <a href="https://erratique.ch/software/odig"><code>odig</code></a>. Odig is a command
line tool to lookup documentation of installed OCaml packages.
</p>

<p>
Once it has made it to the repo, install with <code>opam install ocaml-manual odig</code> and consult the
<a href="https://erratique.ch/software/odig/doc/index">manual</a> (or via <code>odig doc odig</code>).
</p>

<p>
This release provides support for <code>odoc</code> 2.0.0. The <a href="https://github.com/b0-system/odig/blob/master/CHANGES.md#v007-2021-10-09-zagreb">release
notes</a> have all the details.
</p>
</div>
</div>
</div>




<div id="outline-container-12" class="outline-2">
<h2 id="12">OCaml Café: Wed, Oct 13 @ 1pm (U.S. Central)</h2>
<div class="outline-text-2" id="text-12">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-cafe-wed-oct-13-1pm-u-s-central/8610/1">https://discuss.ocaml.org/t/ocaml-cafe-wed-oct-13-1pm-u-s-central/8610/1</a>
</p>
</div>

<div id="outline-container-orge456a60" class="outline-3">
<h3 id="orge456a60">Michael Bacarella announced</h3>
<div class="outline-text-3" id="text-orge456a60">
<p>
<b>Note!</b> This is not our usual time! Past meetups have been at 7pm (U.S. Central). This one is happening at 1pm
(U.S. Central). This meetup should be easier for people in Europe to attend.
</p>

<p>
Please join us at the next OCaml Cafe, a friendly, low stakes opportunity to ask questions about the OCaml language
and ecosystem, work through programming problems that you’re stuck on, and get feedback on your code. Especially
geared toward new and intermediate users, experienced OCaml developers will be available to answer your questions.
Bring your code and we’ll be happy to review it, assist with debugging, and provide recommendations for improvement.
</p>

<p>
This month, David Allsop of OCaml Labs and the University of Cambridge will present on OPAM, the OCaml package
manager. After introducing OPAM, David will discuss the new features of OPAM 2.1, just released at the beginning of
August. Following David's talk, we will open the discussion to all things OCaml-related.
</p>

<p>
Full meeting details, including Zoom link, here:
<a href="https://www.meetup.com/ocaml-cafe/events/281344155/">https://www.meetup.com/ocaml-cafe/events/281344155/</a>
</p>
</div>
</div>
</div>




<div id="outline-container-13" class="outline-2">
<h2 id="13">Multicore OCaml: September 2021, effect handlers will be in OCaml 5.0!</h2>
<div class="outline-text-2" id="text-13">
<p>
Archive: <a href="https://discuss.ocaml.org/t/multicore-ocaml-september-2021-effect-handlers-will-be-in-ocaml-5-0/8554/16">https://discuss.ocaml.org/t/multicore-ocaml-september-2021-effect-handlers-will-be-in-ocaml-5-0/8554/16</a>
</p>
</div>

<div id="outline-container-orgab39700" class="outline-3">
<h3 id="orgab39700">Deep in this thread, Bikal Lem announced</h3>
<div class="outline-text-3" id="text-orgab39700">
<p>
The multicore <a href="https://github.com/ocaml-multicore/eio/pull/82">eio</a> lib has now been migrated to the <b>syntax-free</b>
version. This is the version of effects which will be available in the upcoming OCaml 5.0.0.
</p>

<p>
PR : <a href="https://github.com/ocaml-multicore/eio/pull/82">https://github.com/ocaml-multicore/eio/pull/82</a>
</p>
</div>
</div>
</div>




<div id="outline-container-14" class="outline-2">
<h2 id="14">Alcotest 1.5.0</h2>
<div class="outline-text-2" id="text-14">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-alcotest-1-5-0/8613/1">https://discuss.ocaml.org/t/ann-alcotest-1-5-0/8613/1</a>
</p>
</div>

<div id="outline-container-orgb5e10b1" class="outline-3">
<h3 id="orgb5e10b1">Craig Ferguson announced</h3>
<div class="outline-text-3" id="text-orgb5e10b1">
<p>
I’m pleased to announce the release of <a href="https://github.com/mirage/alcotest/">Alcotest </a> 1.5.0, now available on Opam.
</p>

<p>
This release includes:
</p>

<ul class="org-ul">
<li><p>
<b>JavaScript compatibility</b> (<a href="https://github.com/mirage/alcotest/pull/326">#326</a>), via <code>js_of_ocaml.3.11.0</code>. Projects that build with <code>js_of_ocaml</code> can now use the regular <code>alcotest</code> package to test their JavaScript-compatible libraries. For users of <code>dune</code>, this is as easy as adding <code>(modes ... js)</code> to your <code>test</code> stanzas (to build the JavaScript targets) and a corresponding <code>rule</code> to run the output:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(test
 (name main)
 (modes native js)
 (libraries alcotest))

(rule
 (alias runtest-js)
 (action
  (run node %{dep:main.bc.js})))
</pre>
</div>

<p>
To depend on a version of <code>js_of_ocaml</code> that is supported by Alcotest, add a dependency on the the virtual package <code>alcotest-js</code>.
</p>

<p>
Many thanks @hhugo and @smorimoto for this excellent contribution!
</p></li>

<li><b>Backtrace collection by default</b> (<a href="https://github.com/mirage/alcotest/pull/317">#317</a>). The Alcotest runner now enables backtrace collection by default, ensuring that failing native tests always come with backtraces without any need to set <code>OCAMLRUNPARAM=b</code>.</li>

<li><b>A stable <code>Alcotest.V1</code> module</b> (<a href="https://github.com/mirage/alcotest/pull/306">#306</a>). This module is very similar to the existing top-level <code>Alcotest</code> module, but provides some stability guarantee across major versions. It's intended to provide a migration path for an eventual "Alcotest 2" to make improvements on the existing API.</li>
</ul>

<p>
The full changelog is available <a href="https://github.com/mirage/alcotest/releases/tag/1.5.0">here</a>.
</p>
</div>
</div>
</div>




<div id="outline-container-15" class="outline-2">
<h2 id="15">Other OCaml News</h2>
<div class="outline-text-2" id="text-15">
</div>
