2021.10.12.html
<div id="outline-container-orgea48442" class="outline-3">
<h3 id="orgea48442">From the ocamlcore planet blog</h3>
<div class="outline-text-3" id="text-orgea48442">
<p>
Here are links from many OCaml blogs aggregated at <a href="http://ocaml.org/community/planet/">OCaml Planet</a>.
</p>

<ul class="org-ul">
<li><a href="https://tarides.com/blog/2021-10-04-the-new-replaying-benchmark-in-irmin">The New Replaying Benchmark in Irmin</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orgfd59396" class="outline-2">
<h2 id="orgfd59396">Old CWN</h2>
<div class="outline-text-2" id="text-orgfd59396">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="org6287d0f">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
